In [1]:
import numpy as np
import pandas as pd

In [4]:
# read csv
df = pd.read_csv("/Users/james/Documents/Data/UCI ML Repository/Bank Marketing/bank-additional/bank-additional-full.csv",
                      sep=';')
df.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

### DISPLAY OPTIONS

In [2]:
# view display max rows option
pd.options.display.max_rows

60

In [10]:
# set display max rows option
pd.options.display.max_rows = 999
pd.options.display.max_rows
#pd.options.display.max_rows = None

999

In [12]:
# another way to set display max rows option
pd.set_option('display.max_rows', 100)
pd.get_option('display.max_rows')

100

In [13]:
# and reset option
pd.reset_option("display.max_rows")
pd.get_option('display.max_rows')

60

In [17]:
# can also set/get display max columns
pd.set_option('display.max_columns', 100)
pd.get_option('display.max_columns')

100

### FREQUENCY AND CROSS TAB

In [5]:
# value counts
df.marital.value_counts(dropna=False).sort_index()

divorced     4612
married     24928
single      11568
unknown        80
Name: marital, dtype: int64

In [18]:
# cross tab
pd.crosstab(df.day_of_week, df.y)

y              no   yes
day_of_week
fri          6981   846
mon          7667   847
thu          7578  1045
tue          7137   953
wed          7185   949

In [19]:
# cross tab with % row totals
pd.crosstab(df.day_of_week, df.y).apply(lambda x: x/x.sum(), axis = 1)

y                  no       yes
day_of_week
fri          0.891913  0.108087
mon          0.900517  0.099483
thu          0.878812  0.121188
tue          0.882200  0.117800
wed          0.883329  0.116671

In [20]:
# cross tab with % column totals
pd.crosstab(df.day_of_week, df.y).apply(lambda x: x/x.sum(), axis = 0)

y                  no       yes
day_of_week
fri          0.191009  0.182328
mon          0.209779  0.182543
thu          0.207344  0.225216
tue          0.195277  0.205388
wed          0.196591  0.204526

### FILTERING AND SUBSETTING

In [11]:
# subsetting
df[['age','job','marital']].shape

(41188, 3)

In [10]:
# filtering
df[(df['age'] <= 50) & (df['marital'] == 'single')].shape

(11185, 21)

In [12]:
# filtering & subsetting
df[(df['age'] <= 50) & (df['marital'] == 'single')][['age','job','marital']].shape

(11185, 3)

In [24]:
# drop duplicates, similar to SELECT DISTINCT
df[['job','marital']].drop_duplicates(['job','marital']).reset_index(drop=True)

              job   marital
0       housemaid   married
1        services   married
2          admin.   married
3     blue-collar   married
4      technician    single
5        services    single
6     blue-collar    single
7       housemaid  divorced
8         retired   married
9      management    single
10     unemployed   married
11        retired    single
12     technician   married
13  self-employed   married
14        unknown   married
15     management   married
16    blue-collar  divorced
17     management   unknown
18   entrepreneur   married
19         admin.    single
20     management  divorced
21         admin.  divorced
22        retired  divorced
23       services  divorced
24     technician  divorced
25     unemployed    single
26        unknown  divorced
27        student    single
28  self-employed    single
29      housemaid    single
30     unemployed  divorced
31        unknown    single
32        retired   unknown
33  self-employed  divorced
34   entrepreneur    single
35   entrepreneur  divorced
36        student   married
37       services   unknown
38        unknown   unknown
39         admin.   unknown
40    blue-collar   unknown
41  self-employed   unknown
42     technician   unknown
43        student  divorced
44      housemaid   unknown
45     unemployed   unknown
46   entrepreneur   unknown
47        student   unknown

### GROUP BY

In [13]:
# group by with aggregate and rename
df.groupby(['education'])['age'].agg(['count','mean']).rename(columns={'education':'education_type',
                                                                     'count':'number_customers',
                                                                     'mean':'average_age'})

                     number_customers  average_age
education
basic.4y                         4176    47.596504
basic.6y                         2292    40.448953
basic.9y                         6045    39.061208
high.school                      9515    37.998213
illiterate                         18    48.500000
professional.course              5243    40.080107
university.degree               12168    38.879191
unknown                          1731    43.481225

In [14]:
# group by with filtering
df[(df['age'] <= 50) & (df['marital'] == 'single')].groupby(['education'])['duration'].mean()

education
basic.4y               256.382353
basic.6y               288.317610
basic.9y               260.262826
high.school            270.869129
professional.course    249.633382
university.degree      253.762850
unknown                294.313466
Name: duration, dtype: float64

In [15]:
# another way to group by with filtering
df[(df['age'] <= 50) & (df['marital'] == 'single')].groupby(['education']).agg({'duration':'mean'})

                       duration
education
basic.4y             256.382353
basic.6y             288.317610
basic.9y             260.262826
high.school          270.869129
professional.course  249.633382
university.degree    253.762850
unknown              294.313466

In [26]:
# group by with query, similar to HAVING
df.groupby('marital')['age'].nunique().reset_index().query('age < 30')

   marital  age
3  unknown   27

### TO CSV AND PKL

In [31]:
import pickle as pk

In [28]:
table_to_csv = df[(df['age'] <= 50) & (df['marital'] == 'single')].groupby(['education']).agg({'duration':'mean'})
table_to_csv.head()

                       duration
education
basic.4y             256.382353
basic.6y             288.317610
basic.9y             260.262826
high.school          270.869129
professional.course  249.633382

In [30]:
table_to_csv.to_csv('/Users/james/jupyter_home/table_to_csv.csv')

In [32]:
table_to_csv.to_pickle('/Users/james/jupyter_home/table_to_csv.pkl')

In [34]:
pkl_data = pd.read_pickle('/Users/james/jupyter_home/table_to_csv.pkl')

In [38]:
# write to pickle file, 'wb' refers to write to binary file
pk.dump(table_to_csv,open('/Users/james/jupyter_home/table_to_csv.pkl','wb'))

In [40]:
# read pickle, 'rb' refers to read from binary file
pkl_data = pk.load(open('/Users/james/jupyter_home/table_to_csv.pkl','rb'))
pkl_data.head()

                       duration
education
basic.4y             256.382353
basic.6y             288.317610
basic.9y             260.262826
high.school          270.869129
professional.course  249.633382